---
kind: property
id: P:Autodesk.Revit.UI.Events.CanExecuteEventArgs.IsChecked
source: html/a514ec41-9ed6-cfeb-4de6-14d1227a7f38.htm
---
# Autodesk.Revit.UI.Events.CanExecuteEventArgs.IsChecked Property

The value that indicates whether the UI associated with the Command associated with this event is in a checked state.

## Syntax (C#)
```csharp
public bool IsChecked { get; set; }
```